# Assignment 2. Data Handling

In [41]:
# import essential package
import pandas as pd

## Problem 1. Join and GroupBy

Suppose you want to concatenate two datasets, `exercise1_boxA.csv` and `exercise1_boxB.csv`.

In [42]:
df_a = pd.read_csv('boxA.csv')
df_a

   ProductCode  Weight_gram Membership  Price
0        CS001          547        YES  26800
1        CS002          836         NO  17700
2        CS004          506        YES  19900
3        CS006          766        YES  18200
4        CS008          871         NO   8300
5        CS009          361         NO  14300
6        CS010          375        YES   6900
7        CS012          804         NO  22500
8        CS013          386        YES  11500
9        CS014          847        YES  18100
10       CS015          728         NO  22300

In [43]:
df_b = pd.read_csv('boxB.csv')
df_b

  ProductCode  Weight_gram Membership
0       CS001          547        YES
1       CS003          441         NO
2       CS005          229        YES
3       CS006          766        YES
4       CS007          634         NO
5       CS009          361         NO
6       CS010          375        YES
7       CS011          527         NO
8       CS013          386        YES
9       CS015          728         NO

However, you realized that the `price` column is missing in `exercise1_boxB` dataframe!

The price info of all products can be found in `exercise1_price.csv`.

In [44]:
df_p = pd.read_csv('price.csv')
df_p

   ProductCode  Price
0        CS010   6900
1        CS008   8300
2        CS013  11500
3        CS009  14300
4        CS002  17700
5        CS006  18200
6        CS007  20700
7        CS015  22300
8        CS012  22500
9        CS003  23400
10       CS005  24000
11       CS011  25500
12       CS001  26800

#### 1. Add the `price` column to `exercise1_boxB` using the `exercise1_price` table.

In [45]:
df_b = pd.merge(df_b, df_p, how = 'left', left_on = 'ProductCode', right_on = 'ProductCode')
df_b

  ProductCode  Weight_gram Membership  Price
0       CS001          547        YES  26800
1       CS003          441         NO  23400
2       CS005          229        YES  24000
3       CS006          766        YES  18200
4       CS007          634         NO  20700
5       CS009          361         NO  14300
6       CS010          375        YES   6900
7       CS011          527         NO  25500
8       CS013          386        YES  11500
9       CS015          728         NO  22300

#### 2. Concatenate the two tables, `exercise1_boxA.csv` and `exercise1_boxB.csv` into one table and drop duplicate rows. 

Hint: use `.drop_duplicates()` method. After that, there will be 15 rows remained.

In [46]:
df = pd.concat([df_a, df_b], axis = 0).drop_duplicates()
df

   ProductCode  Weight_gram Membership  Price
0        CS001          547        YES  26800
1        CS002          836         NO  17700
2        CS004          506        YES  19900
3        CS006          766        YES  18200
4        CS008          871         NO   8300
5        CS009          361         NO  14300
6        CS010          375        YES   6900
7        CS012          804         NO  22500
8        CS013          386        YES  11500
9        CS014          847        YES  18100
10       CS015          728         NO  22300
1        CS003          441         NO  23400
2        CS005          229        YES  24000
4        CS007          634         NO  20700
7        CS011          527         NO  25500

#### 4. Find the mean and median of `Weight_gram` and `Price` grouped by `Membership`.

Hint: use `groupby()` method.

Note: Round to the nearest integer.

In [47]:
# mean
round(df.groupby('Membership').mean(), 1)

            Weight_gram    Price
Membership
NO                650.2  19337.5
YES               522.3  17914.3

In [48]:
# median
round(df.groupby('Membership').median(), 1)

            Weight_gram  Price
Membership
NO                  681  21500
YES                 506  18200